{"pageProps":{"photo":"/static/images/Team/2023/Shreyas_Atre.jpg","title":"GSoC 2021 with BeagleBoard.org","author":"Shreyas Atre","time":"May - September 2021","short":"Implemented Beagle-Config on BeagleBone Boards ","content":"# What was your internship about, and what was the duration of it ?\n\nGoogle summer of code is an international, annual program in which Google awards stipends to students who successfully complete a free and open-source software coding project during the summer. I was working with BeagleBoard for this period, it is designs open source Single Board computers, like the BeagleBone Black, BeagleBone AI, BeagleV, etc. Application period for it was in March, and we had to submit a detailed proposal for the project Idea I wanted to work on. It was a 12 weeks long program.\n\n# How do you approach the Organization/University ?\n\nI joined their IRC channel, and communicated with my mentors about my interest in the\n\nproject, then one has to sign up with GSoC portal, and upload the project proposal for the specific project, which would be then reviewed by the organization. Vedant who had already had his previous GSoC helped me through it.\n\n# What was your project about ?\n\nCurrently beaglebone boards are closer to debian and requires additional configurations to enable user capabilities like sharing internet, connecting to wifi,etc. To make life of the user a bit more easier I had proposed beagle-config which has taken inspiration from raspi-config. It provides an easy interface to make configurations. Also it is plug-able i.e. various configurations can be added in any point of time and can be modified as well. Also it provides a check for minimal compatibility and support across various beaglebone boards.\n\n# How was the host University in terms of research and campus life ?\n\nIt was remote, N/A\n\n# How much was your stipend ?\n\nIt was $1500 divided into 2 evaluations.\n\n# Can you provide any resources to check out your project ?\n\nHere's my project report: [https://summerofcode.withgoogle.com/projects/#6718016412188672](https://summerofcode.withgoogle.com/projects/#6718016412188672)\n\nHere's my project repository: [https://github.com/SAtacker/beagle-config](https://github.com/SAtacker/beagle-config)\n\n# Suggestions to the fellow VJTIians who want to go for this internship.\n\nDon't underestimate yourself, start what you truly wish for ASAP.\n\n# What is the best way to contact you ?\n\nYou can contact me at my email, [shreyasatre16@gmail.com](mailto:shreyasatre16@gmail.com)\n"},"__N_SSG":true}