{"pageProps":{"photo":"/static/images/Team/2023/Karthik_Swaminathan.jpeg","title":"Stoch Lab IISc","author":"Karthik Swaminathan","time":"December 2021 - March 2022","short":"Creating multiple prototypes of a responsive foot, current quadruped at the lab(Stoch-3) had some structural failures and parts used to bend after operation. So my task was to create a closed structure for abduction (abduction coupling).","content":"# What was your internship about, and what was the duration of it ?\n\nI did my internship at Stochastic Robotics Lab at the Indian Institute of Science(IISc).The Lab focuses on implementing new technologies in the field of legged robotics(Quadruped, bipeds). My internship started in the month of December 2021 and I worked in offline mode for a month and later continued my internship in online mode for 3 months. The Lab is working on improving the current quadruped(Stoch-3) and is also developing a quadruped of small size focusing more on it being responsive and quick.\n\n# How do you approach the Organization/University ?\n\nI cold mailed Professor Shishir directly at his email address (shishirk@iiisc.ac.in). You can check out the “join us” section of the lab (https://www.stochlab.com/join.html ). They usually have positions for interns. The Professor will arrange an interview and based on your profile and experiences, he assigns the task and we can collaborate and work with phd students/interns/visiting students there.\n\n# What was your project about ?\n\nI was part of the Mechanical Team there. From the mechanical side, I was given the task to work on i) Creating multiple prototypes of a responsive foot that involved inclusion of Force Sensor Resistor(FSR) data to get details about the contact and the force exerted on a particular foot of the quadruped. This task was in collaboration with my colleague - Saad Hashmi. We 3D printed foot designs based on the structure of the leg and calculated the weight applied and response that we received from the foot. ii) The current quadruped at the lab(Stoch-3) had some structural failures and parts used to bend after operation. So my task was to create a closed structure for abduction (abduction coupling) keeping in mind the manufacturing process( laser cut/CNC machining), structural deformation and stresses after analysis.\n\n# How was the host University in terms of research and campus life ?\n\nReceived the opportunity to work there in physical mode and got to interact with interns, PhD students and Professor directly. The lab contained a lot of equipment that was needed for testing, and we had access to it. There used to be meetings when the professor was directly involved in the conversation, and the project flow and difficulties encountered were discussed. The professor also collaborates with organizations like DRDO, ISRO for their projects. The campus is very huge and spread out and has numerous facilities.\n\n# How much was your stipend ?\n\nN/A, StochLabs is a Government Funded Lab, so there are no stipends for interns, but there are full time positions offered at the Lab.\n\n# Can you provide any resources to check out your project ?\n\nN/A\n\n# Suggestions to the fellow VJTIians who want to go for this internship.\n\nThe Lab works in three domains as I mentioned earlier. If you have an interest in Designing, Prototyping and Manufacturing you can join the Mechanical Team provided you have sufficient knowledge about structures, analysis and about manufacturing processes. If you are inclined more towards the software side, there are tasks that involve use of ROS, Mujoco and RL based implementations. For Embedded Side, there is always a constant modification in Circuit Design, experience in control using microcontroller(like RPi) is preferable. To get a complete overview of current projects and work there, directly contact Prof. Shishir Kolathaya (shishirk@iisc.ac.in)\n\n# What is the best way to contact you ?\n\nYou can contact me through email (kswaminathan_b19@me.vjti.ac.in) or LinkedIn(https://www.linkedin.com/in/karthik-swaminathan-24644a1a2/ )\n"},"__N_SSG":true}