{"pageProps":{"photo":"/static/images/Team/Dhruva.jpeg","title":"GSoC 2021 with BeagleBoard.org","author":"Dhruva Gole","time":"May - August 2021","short":"Implemented Bela on BeagleBoard and Developed a standardized setup that allows an easy jump across all TI chips. ","content":"# What was your internship about, and what was the duration of it ?\n\nGoogle Summer of Code is an international, annual program in which Google awards stipends to students who successfully complete a free and open-source software coding project during the summer. I was working with BeagleBoard for this period, it designs open source Single Board computers, like the BeagleBone Black, BeagleBone AI, BeagleV, etc. Application period for it was in March, and we had to submit a detailed proposal for the project Idea I wanted to work on. It was a 12 weeks long program.\n\n# How do you approach the Organization/University ?\n\nI joined their IRC and slack channel, and communicated with my mentors about my interest in the project. Then one has to sign up with the GSoC portal, and upload the project proposal for the specific project, which would then be reviewed by the organization.\n\n# What was your project about ?\n\nAs given on the official website, Bela is a hardware and software system for creating beautiful interaction with sensors and sound.\nBela has a lot of analog and digital inputs and outputs for hooking up sensors and controlling other devices, and most importantly Bela has stereo audio i/o allowing you to interact with the world of sound.\nAll Bela systems so far use the same Bela software. It uses a customized Debian distribution which - most notably - uses a Xenomai kernel instead of a stock kernel. Xenomai is co-kernel for Linux which allows to achieve hard real-time performance on Linux machines (ref: xenomai.org). It thus takes advantage of features of the BeagleBone computers and can achieve extremely low-latency audio and sensor processing times.\nAlthough the proposal Title mentions support for AI, I have developed a standardized setup that allows an easy jump across all TI chips.\n\n# How was the host University in terms of research and campus life ?\n\nIt was remote, N/A\n\n# How much was your stipend ?\n\nIt was $1500 divided into 2 evaluations.\n\n# Can you provide any resources to check out your project ?\n\nHere's my project report: [https://dhruvag2000.github.io/Blog-GSoC21/](https://dhruvag2000.github.io/Blog-GSoC21/)\n\nHere's my project repository: [https://github.com/giuliomoro/Bela-dhruva](https://github.com/giuliomoro/Bela-dhruva)\n\n# Suggestions to the fellow VJTIians who want to go for this internship.\n\nStart early, join the organization's communication channel from January itself, and start contributing to their projects, take part in meetings and interact with the possible mentors. It is assumed that you are a complete beginner so DO NOT shy away from asking questions. It only shows your keen interest and may help you get selected even.\n\n# What is the best way to contact you ?\n\nYou can contact me at my email, [goledhruva@gmail.com](mailto:goledhruva@gmail.com)\n"},"__N_SSG":true}