{"pageProps":{"photo":"/static/images/Team/Rahul.JPG","title":"Airpix","author":"Rahul Singh","time":"June 2020 - March 2021","short":"Developed an application for vehicle counting, detecting violations like wrong side, red light, speed, helmet and triple seat.","content":"# What was your internship about, and what was the duration of it ?\n\n[Airpix](https://airpix.in/) is a drone / unmanned aerial systems startup based in Navi Mumbai, India. [Airpix.io](https://airpix.io/) is an analytics platform that provides services in face recognition, video analytics, optical character recognition by Leveraging AI, Machine Learning &amp; Deep Learning technologies. [AIsyte](https://aisyte.com/) is the product that provides these analytics services.\n\nMy position in internship was 'AI ML and Edge Computing Intern'. The tasks were related to developing applications for Traffic monitoring, Face recognition, Pose estimation, etc. The position required knowledge in Python, Numpy, OpenCV, Deep Learning frameworks like Tensorflow, Keras, Pytorch, etc. It started with a 3 months unpaid internship. After that I was given the opportunity to continue the work with a paid internship. I worked under the guidance of Aniket Tatipamula.\n\n# How do you approach the Organization/University ?\n\nThe application form was sent by my college. But you can also reach out to them via email or linkedin.\n\n# What was your project about ?\n\nIn the first 3 months, we were divided into groups to tackle different problems. I was part of the group - Traffic violation. The task was to develop an application for vehicle counting, detecting violations like wrong side, red light, speed, helmet and triple seat.\n\nWe started with listing out the requirements of the product, its users, use cases, deployment requirements and reviewed the technologies available in the market. There used to be meetings at least 2-3 days a week with the mentor. After listing the requirements the task was to get familiar with the object detection networks like yolo, ssd, etc. In the first two weeks I studied about the yolo network (running the pre-trained network and training it for custom classes like helmet). The next task was to track the object and count them. I studied different trackers available like OpenCV inbuilt trackers, SORT, Deep-SORT, etc. After analyzing the runtime, memory and other aspects we decided to use a particular tracker and started with the counting part. Several techniques were tried for the counting part to handle different edge cases. Till this point the team got familiar with the tech and the requirements. We divided the task among ourselves and started working on the application. At the end of 3 months, we were ready with the desktop application providing an interface to add recording, count vehicles based on classes, and detect all the violations.\n\nI had been approached by the organization to continue the work which we had left previously. I started working with them after the end semester exams were over.\n\nThe task given to me was to package our application and create a docker container for it.The advantage of docker container were that all your application and dependencies could be packaged as whole, such that the next time you want to deploy your application to the host computer, all you needed to do was to just install the docker container from the repository and execute it, nothing else was needed to install. I was also tasked with on how could we spawn multiple docker containers at a time, and also check if the minimum resources were available before starting a new container. My other task were to optimize the object detection model such as yolov3 and ssd-mobilenet with Nvidia's TensorRt sdk so that it could work with a higher fps on their edge boards,Jetson Nano and Jetson AGX. Wrote a small code which checked for system configuration, based on that used to install the docker container. Also used to sort out any issue which occurred on the AGX board.\n\n# How was the host in terms of research and campus life ?\n\nIt was remote, N/A\n\n# How much was your stipend ?\n\nConfidential\n\n# Can you provide any resources to check out your project ?\n\nConfidential\n\n# What is the best way to contact you ?\n\nYou can contact me at my email, rahulsinghrox701@gmail.com\n"},"__N_SSG":true}