{"pageProps":{"photo":"/static/images/Team/Vednarayan.jpg","title":"DU, New Delhi","author":"Vednarayan Iyer","time":"Dec 2019- Jan 2020","short":"Tried to implement ‘Time Crystals’ as a scalar field for inflationary cosmology ","content":"# What was your internship about, and what was the duration of it ?\n\nI was a research intern under Dr. Patrick Das Gupta from Delhi university. The main focus of my research was early time cosmology. The research was completely theoretical and the prerequisites included tensor calculus, differential equations and basic knowledge regarding general relativity. It was a two month long winter internship.\n\n# How do you approach the Organization/University ?\n\nIn general, there are summer internships available at such universities but I was late to apply so I started contacting several professors through their email id available at the university website. I got a positive response from Dr. Patrick Das Gupta but he was unavailable in the coming summer, hence it was a winter internship.\n\n# What was your project about ?\n\nInitially, there wasn't any particular problem statement on which I was working. Being from an engineering background there were a lot of prerequisites to be understood. Under the professor's guidance, I learned about general relativity followed by its application in the Friedmann–Lemaître–Robertson–Walker (FLRW) Models in cosmology. I then investigated the early universe cosmology and the various theories proposed regarding the same. I got to know about the horizon problem and the flatness problem and how inflationary cosmology solves it. While learning inflationary cosmology I also understood how cosmological fluctuation brings a structure to the universe by understanding Cosmological Perturbation Theory. During this brief period, I was able to develop my mathematical skills in tensor algebra, tensor calculus, differential calculus and also gained contemporary knowledge in the field of cosmology. After gaining the required knowledge I decided my primary research area to be 'The Cosmological Constant Problem'. I tried to implement 'Time Crystals' as a scalar field for inflationary cosmology which leads to an arbitrarily small positive effective Cosmological Constant.\n\n# How was the host University in terms of research and campus life ?\n\nAs it was not an official internship under the university, I had to stay outside the campus and only interacted with the professors twice a week.\n\n# How much was your stipend ?\n\nN.A.\n\n# Can you provide any resources to check out your project ?\n\nN.A.\n\n# Suggestions to the fellow VJTIians who want to go for this internship.\n\nThere are a lot of opportunities available to work as a research intern in physics. The official summer internship programs start around september. To list a few:\n\n- [https://home.cern/summer-student-programme](https://home.cern/summer-student-programme)\n\n- [https://www.isro.gov.in/research-and-academia-interface/internships-projects-training](https://www.isro.gov.in/research-and-academia-interface/internships-projects-training)\n\n- [https://www.iiap.res.in/?q=degree](https://www.iiap.res.in/?q=degree)\n\nBesides these, every iiser and a few iits have their own summer internship programs available at their websites.\n\nIn my case, I was a bit late to apply to most of these and to get an opportunity to work on the purely theoretical side of physics is a bit difficult for engineering students. So, I started emailing a lot of professors to ask for their guidance and if possible to work under them as a research intern. I tried to contact around 60-70 professors, half of which didn't reply and from the other half I got a negative response. After a month-long effort I received a positive response from Patrick sir. So my suggestion is to keep applying for programs, official or not, as much as you can.\n\n# What is the best way to contact you ?\n\n[vednarayan29@gmail.com](mailto:vednarayan29@gmail.com)\n"},"__N_SSG":true}