{"pageProps":{"photo":"/static/images/Team/2023/Gautam_Agrawal.jpeg","title":"OSPP 2021 with Project C","author":"Gautam Agrawal","time":"July - October 2021","short":"Implemented BMQ(Bit Map Queue) and PDS-mq(Priority and Deadline based Skiplist multiple queue) cpu scheduler support for Linux Kernel 5.10","content":"# What was your internship about, and what was the duration of it ?\n\nOpen Source Promotion Plan is an international, annual program in which PRC awards stipends to students who successfully complete a free and open source software coding project during the summer. I was working with Project-C, which is an open source project that provides BMQ(Bit Map Queue) and PDS-mq(Priority and Deadline based Skiplist multiple queue) cpu scheduler support.\n\n# How do you approach the Organization/University ?\n\nI mailed the mentor regarding my interest in the project. He asked me to submit a summary on schedulers and my knowledge on linux kernel tree via email. I also registered on the OSPP portal and submitted a proposal regarding the projects, with detailed description of the timeline.\n\n# What was your project about ?\n\nLinux kernel 5.10 LTS is the long term support branch of linux kernel, i.e. support for latest driver and scheduler given in latest kernel version should be back ported to the linux 5.10 so that the industry using the LTS version do not suffer any issues. My project was to backport the scheduler feature from Linux 5.13 and Linux 5.12 to the LTS version. The backport required reviewing commits and understanding the major part of the scheduler. At the end of the project, the last 2 weeks were spent to run the test on the kernel, few reported bugs were solved and the Linux 5.10 LTS patch was released.\n\n# How was the host University in terms of research and campus life ?\n\nIt was remote.N/A\n\n# How much was your stipend ?\n\n$1400\n\n# Can you provide any resources to check out your project ?\n\nHere is my project repository :- [https://gitlab.com/alfredchen/projectc](https://gitlab.com/alfredchen/projectc)\n\n# Suggestions to the fellow VJTIians who want to go for this internship.\n\nGet connected with the mentor as soon as the Selected Organizations are listed. Complete all the tasks given by the mentor and go to extra length to promote a technical discussion with the mentor relevant to the project.\n\n# What is the best way to contact you ?\n\nYou can contact me at my email, [gautamnagrawal@gmail.com](mailto:gautamnagrawal@gmail.com)\n"},"__N_SSG":true}