{"pageProps":{"photo":"/static/images/Team/2023/Prathamesh_Profile.jpeg","title":"Research intern in PLCT Lab, ISCAS","author":"Prathamesh Tagore","time":"December 2021 - Present","short":"We are developing a performance oriented C++ library for Image processing using MLIR as its backend.","content":"# What was your internship about, and what was the duration of it ?\n\nMy internship was about HPC via compiler and algorithmic optimizations for Image Processing. We started in Dec. 2021 and am still engaged with the project. To manage my college and other workload better, we did take some breaks (for about 3 months) in between.\n\n# How do you approach the Organization/University ?\n\nI was a mentee in The Linux Foundation mentorship program with RISC-V. My mentor (a PhD candidate in PLCT lab) offered me this internship after my LFX term ended. To help us more with the research part, I was also monitored by a professor during the PLCT lab internship unlike the LFX mentorship.\n\n# What was your project about ?\n\nWe are developing a performance oriented C++ library for Image processing using MLIR as its backend. I developed a dedicated dialect for image processing in MLIR named Digital Image Processing (DIP) dialect which integrates our custom IR (along with higher level patterns) into the LLVM infrastructure through previously developed lowering passes.\n\n# How was the host University in terms of research and campus life ?\n\nIt was a remote internship. The environment is supportive and helpful.\n\n# How much was your stipend ?\n\nUSD 1000 per month.\n\n# Can you provide any resources to check out your project ?\n\nThis is our GitHub organization : https://github.com/buddy-compiler\n\n# Suggestions to the fellow VJTIians who want to go for this internship.\n\nBe thorough with C++, basics of compiler backend, LLVM style lowering and Image Processing. Sound communication skills help a ton.\n\n# What is the best way to contact you ?\n\nIf you are not on discord - prathameshtagore@gmail.com\n"},"__N_SSG":true}