{"pageProps":{"photo":"/static/images/Team/2024/Premraj_Jadhav_24.jpg","title":"Internship at IIT Bombay @eyantra","author":"Premraj Jadhav","time":"June 2022 - July 2022","short":"My project was Ball levitation using computer vision on FPGA.","content":"# What was your internship about, and what was the duration of it ?\n\ne-Yantra is a robotics outreach program funded by the Ministry of Education and hosted at IIT Bombay. I was a Summer Intern at the eYantra Lab, IIT Bombay working on the project ‘Ball levitation using computer vision on FPGA’. This was a 6 to 7 week long project.\n\n# How do you approach the Organization/University ?\n\nE-Yantra gives a chance of internship to the winners of their annual robotics competition EYRC (E-yantra robotics competition) and E-Yantra innovation challenge (EYIC). In our case we did not win the competition but based on our performance throughout the competition, they gave us a chance to appear for an interview.\n\n# What was your project about ?\n\nMy project was ‘Ball levitation using computer vision on FPGA’. In this project I programmed computer vision functions like blob detection and contour detection in verilog and using this system we controlled the height of a levitating ball. This project included various domains like FPGA, Computer vision, Control system, etc.\n\n# How was the host University in terms of research and campus life ?\n\nCampus experience at IIT-B was quite good. All facilities are available for eYantra Interns. Working alongside fellow interns from different parts of the country is a nice experience. E-yantra lab is full of technology and ideas. They appreciate and support innovative ideas.\n\n# How much was your stipend ?\n\nConfidential.\n\n# Can you provide any resources to check out your project ?\n\nThe project is not currently open sourced. If ever it becomes open sourced that I will put up a link here.\n\n# Suggestions to the fellow VJTIians who want to go for this internship.\n\nParticipate in EYRC and put your efforts in it. Don’t give up even if you fail to do tasks within deadlines, show your dedication. For the interview, choose the projects wisely, research them well.\n\n# What is the best way to contact you ?\n\nYou can contact me at my email, [premrajjadhav02@gmail.com](mailto:premrajjadhav02@gmail.com) or [LinkedIn](https://www.linkedin.com/in/premraj-jadhav-448a33233)\n"},"__N_SSG":true}