{"pageProps":{"photo":"/static/images/Team/2023/Prathamesh_Profile.jpeg","title":"GSoC 2021 with Boost C++ Libraries","author":"Prathamesh Tagore","time":"May - September 2021","short":" Redesigned and Optimised GIL & 2D Convolution/Correlation APIs","content":"# What was your internship about, and what was the duration of it ?\n\nThe **Google Summer of Code** , often abbreviated to **GSoC** , is an international annual program in which [Google](https://en.wikipedia.org/wiki/Google) awards [stipends](https://en.wikipedia.org/wiki/Stipend) to students who successfully complete a [free and open-source software](https://en.wikipedia.org/wiki/Free_and_open-source_software) coding project during the summer. The program is open to university students aged 18 or over. Project ideas are listed by host organizations involved in open-source software development, though students can also propose their own project ideas.\n\nI did my GSoC with Boost C++ Libraries from May 2021 to August 2021. Boost C++ Libraries is an open source organization which provides many useful open source C++ libraries whose application include socket programming, image processing, BLAS operations, improved metaprogramming paradigms, etc. in C++. I wrote code for Boost's Generic Image Library(Boost GIL) which provides native APIs for performing image processing related operations in C++.\n\n# How do you approach the Organization/University ?\n\nI approached them via Slack during the month of January.\n\n# What was your project about ?\n\nMy project involved redesigning and optimizing GIL's 2D Convolution/Correlation API's. Specific tasks included improving the temporal access pattern of the algorithm, providing more options for boundary extrapolation, writing a custom algorithm for dealing with spatially separable 2D Correlation, etc.\n\n# How was the host University in terms of research and campus life ?\n\nGSoC is remote, N/A\n\n# How much was your stipend ?\n\n**$1500** in 2 evaluations of 45% (week 6) and 55%(week 10) payment\n\n# Can you provide any resources to check out your project ?\n\n[Final submission report for GSoC 2021](https://gist.github.com/meshtag/17fb6ae2a3562d12af335ffa41a82226)\n\n# Suggestions to the fellow VJTIians who want to go for this internship.\n\nStart early, preferably from the month of January. Ask questions to mentors only after doing everything you can to find the answer on your own. Use the library before you start contributing to it, this would help you understand the structure of provided APIs and the reason behind them. Regularly monitor the mailing list and slack to keep a track of active discussions and participate in them once you gain sufficient knowledge. Always, fulfill your commitments so that the mentors can trust your temperament for completion of the GSoC project.\n\n# What is the best way to contact you ?\n\nYou can contact me via email at [prathameshtagore@gmail.com](mailto:prathameshtagore@gmail.com)\n"},"__N_SSG":true}