{"pageProps":{"photo":"/static/images/Team/2024/Sagar_Chotalia_2024.jpg","title":"Google Summer of Code with RADIS(OpenAstronomy)","author":"Sagar Chotalia","time":"June 2022 - September 2022","short":"My project was about improving and tweaking the performance of the RADIS codebase.","content":"# What was your internship about, and what was the duration of it ?\n\nGoogle Summer of Code is a global, online program focused on bringing new contributors into open source software development. GSoC Contributors work with an open source organization on a 12+ week programming project under the guidance of mentors. My project was under the sub-org RADIS, which comes under the umbrella org OpenAstronomy.\n\n# How do you approach the Organization/University ?\n\nSelections are mainly done on the basis of contributions to the org’s GitHub repository, solving issues and then submitting a proposal to work on a project of your choice. My proposal was reviewed by the sub-org maintainer atleast 5-6 times before he said it was good enough.\n\n# What was your project about ?\n\nMy project was about improving and tweaking the performance of the RADIS codebase. Initially, my project also involved showing a Proof-of-Concept for moving dataset handling from the Pandas library to a library better suited for huge datasets, such as Vaex or Dask. However, this plan was scrapped after a discussion with my maintainer, who informed me that it would take me more than the time limit of my project.\n\n# How was the host University in terms of research and campus life ?\n\nGSoC was online. My organisation and the mentors were excellent. The main mentor assigned to me never really talked to me during my project duration, so I got to interact with the maintainer of the RADIS repo throughout my internship. He was really kind and understanding, even allowing for timeline restructuring because I was working on another internship at the time.\n\n# How much was your stipend ?\n\n$1500 in 2 evaluations of 45% (week 6) and 55% (week 12) payment\n\n# Can you provide any resources to check out your project ?\n\nHere’s the link to my GSoC [Blog](https://sagarchotalia.github.io/Blog/) and the RADIS [repository](https://github.com/radis/radis).\n\n# Suggestions to the fellow VJTIians who want to go for this internship.\n\nStart GSoC preparation early. Decide on an organisation after joining the Slack/IRC channels, be active on them and start solving good first issues by February itself. This will give you a huge advantage when the time comes for your proposal to be ranked.\n\n# What is the best way to contact you ?\n\nYou can contact me at my email, [sagarchotalia2@gmail.com](mailto: sagarchotalia2@gmail.com)\n"},"__N_SSG":true}