{"pageProps":{"photo":"/static/images/Team/2023/Dhairya_Shah.jpg","title":" MITACS GRI 2022 @ École de Technologie Supérieure ÉTS","author":"Dhairya Shah","time":"May 2022 - August 2022","short":"Worked on developing firmware for and synchronize real-time multi sensor stream data.","content":"# What was your internship about, and what was the duration of it ?\n\nMitacs Globalink Research Internship is a competitive initiative for international undergraduates from the following countries and regions: Australia, Brazil, China, Colombia, France, Germany, Hong Kong, India, Tunisia, Ukraine, United Kingdom and the United States. From May to October of each year, top-ranked applicants participate in a 12-week (Mine was 10.5 weeks) research internship under the supervision of Canadian university faculty members in a variety of academic disciplines, from science, engineering, and mathematics to the humanities and social sciences. The internship duration is flexible from about 8 - 12 weeks depending on the project size subjected to approval from your Host Professor.\n\n# How do you approach the Organization/University ?\n\nYou need to apply through the MITACS portal. Applications open around July - August.\n\n# What was your project about ?\n\nThe main aim of my project was to develop firmware for and synchronize real-time multi sensor stream data. A study was done to analyze biological changes in the bodies of musicians singing synchronously in an orchestra. To facilitate this study, various sensors for monitoring heart beat, pulse, breathing, ECG, PPG and real time audio data were the input parameters. To study and note changes in successive events, time synchronization amongst these streams was necessary. Also, these streams were visualized and a white paper was written about it.\n\n# How was the host University in terms of research and campus life ?\n\nThe internship took place offline in-person at Montreal, Canada. ETS is situated in the heart of downtown Montreal. Accommodation near downtown is easily findable but could be a bit costly. The University being in the state of Quebec, has French as its primary language and English as its secondary. ETS has the motto - “Engineering for Industry” and hence has a lot of conferences and industry exposure. The campus is accessible throughout with RFID access cards at any time of the day or night, no restrictions. ETS campus is big and has about 5 buildings. My host lab was CRITIAS led by Prof. Dr. Jérémie Voix funded by NSERC-EERS Canadian-Industrial research chair. The lab research majorly focusses on audio & signal processing, acoustics, in-ear wearable and embedded technologies. The lab officially functions from Monday - Friday 9 to 5 pm. However, the timings and work are flexible. Dynamic research, new methodologies, and trial-tests are highly encouraged. Being a part of the research team gave me access to multiple resources, weekly conference calls, university events and industry networking meets. I also got to learn a lot from the MS and Phd students working at my lab.\n\n# How much was your stipend ?\n\nThe total compensation included shares for flight tickets, visa, accommodation, food and institute fees which was about 8000 CAD. This was given in 3 installments distributed across the duration of 3 month internship.\n\n# Can you provide any resources to check out your project ?\n\nThe project is not currently open sourced. If ever it becomes open sourced that I will put up a link here. Link to my work technology - http://critias.etsmtl.ca/the-technology/arp/\n\n# Suggestions to the fellow VJTIians who want to go for this internship.\n\nChoose your project and mentor correctly through the list of more than 2000 projects. Start by looking for labs under top universities aligning with your research interests. Go through university specializations. Look at their past interns, projects and publications. You can connect with them over LinkedIn, Mail, etc.\n\nThere is no letter of motivation for this internship. Your selling point is your application and resume. The more research experience you have, the better. I would suggest people to do at least some internship after 2nd year instead of wasting their summer. Also it is possible to work within semesters so try to explore the things that you like by doing a project/ internship etc. as college is not going to teach you anything good. Moreover, getting a Mitacs GRI also enables you for the Mitacs Accelerate Fellowship for doing a masters/ Phd in Canada.\n\n# What is the best way to contact you ?\n\nYou can contact me at my email, dhairyashah110501@gmail.com. Feel free to contact me for any queries or doubts.\n"},"__N_SSG":true}