{"pageProps":{"photo":"/static/images/Team/2024/Aniruddha_Thakre_24.jpg","title":"Internship at IIT Bombay @eyantra","author":"Aniruddha Thakre","time":"June 2022 - July 2022","short":"The goal of my project, \"SBR: Self balancing bot,\" was to build an effective and modular CAD design of a self balancing bot that would be used as an educational product for various personas.","content":"# What was your internship about, and what was the duration of it ?\n\ne-Yantra is a robotics outreach program funded by the Ministry of Education and hosted at IIT Bombay. They have different competitions such as the e-Yantra Robotics Competition, e-Yantra Innovation Challenge, etc. I was a Summer Intern at the e-Yantra Lab, IIT Bombay working on a Robotics Project for a period of about 7 weeks.\n\n# How do you approach the Organization/University ?\n\nCandidates are chosen from contests like the E-YRC and E-YIC based on their performance, and they are then offered the chance to participate in interviews. The interviews consist of a group stage followed by an individual interview.\n\n# What was your project about ?\n\nThe goal of my project, \"SBR: Self balancing bot,\" was to build an effective and modular CAD design of a self balancing bot that would be used as an educational product for various personas. We needed to provide slots for various required components and slots where the user can place, test, or use different sensors on the bot. For the same reason, we had to design a custom PCB for the e-Yantra developed board called the e-Yfi Mega.\n\n# How was the host University in terms of research and campus life ?\n\nThe campus experience at IIT Bombay was amazing. The facilities related to our work such as a good working space, required hardware for our project, etc were provided to us. Even the other on-campus facilities were great. Also, we had to team up with people from all over the country which was a great learning experience for all of us.\n\n# How much was your stipend ?\n\nConfidential.\n\n# Can you provide any resources to check out your project ?\n\nThe project is not currently open sourced. If ever it becomes open sourced that I will put up a link here.\n\n# Suggestions to the fellow VJTIians who want to go for this internship.\n\nPerform well in the e-Yantra Robotics Competition and give the interviews confidently. Also research about the projects you have listed in your preferences.\n\n# What is the best way to contact you ?\n\nYou can contact me at my email, [thakreaniruddha1@gmail.com](mailto:thakreaniruddha1@gmail.com)\n"},"__N_SSG":true}