{"pageProps":{"photo":"/static/images/Team/2023/Shreyas_Atre.jpg","title":"Research Fellow @ IIT-KGP","author":"Shreyas Atre","time":"May 2022 - July 2022","short":"Worked on GPGPU co-scheduling algorithm.","content":"# What was your internship about, and what was the duration of it ?\n\nIt was about the GPGPU co-scheduling algorithm.\nIt was about an interesting concept, and a new experience as it was about writing an algorithm to optimize memory for static budgets.\nI never did any DSA, and it got me hard. I nearly messed this up with a mediocre algorithm that did a 20% reduction in run time memory usage by destroying the parallel nature of CUDA streams.\nCouldn't think of something better. The mentor’s name was Danny Periera (very helpful) and the prof was Dr. Soumyajit Dey.\n\n# How do you approach the Organization/University ?\n\nI applied through the IIT-KGP website, which redirected the applicants to a Google Form link.\n\n# What was your project about ?\n\nRead my report [here](https://drive.google.com/file/d/1JwEKxROY032WaSQX4hATHqtf75X_2jV3/view?usp=sharing).\n\n# How was the host University in terms of research and campus life ?\n\nI did a remote internship because they couldn’t provide me with accommodations on campus during COVID-19 and post that mess.\n\n# How much was your stipend ?\n\nINR 14000 in total. They declined me an LoR because the policy is that students should work for at least 8-9 months.\n\n# Can you provide any resources to check out your project ?\n\nRead my report [here](https://drive.google.com/file/d/1JwEKxROY032WaSQX4hATHqtf75X_2jV3/view?usp=sharing). The github repository is private until I am instructed to make it public.\n\n# Suggestions to the fellow VJTIians who want to go for this internship.\n\nYou should ask much more deeper questions about the project that give you a clear idea of what you'll be actually doing.\nHonestly I was expecting to write a lower level code and I did not imagine myself writing an algorithm as I never did CP.\n\n# What is the best way to contact you ?\n\nIf you are not on discord - shreyasatre16 AT gmail dot com\n"},"__N_SSG":true}