{"pageProps":{"photo":"/static/images/Team/Vedant.jpg","title":"MITACS GRI 2021 @ Carleton University","author":"Vedant Paranjape","time":"May - September 2021","short":"Worked on simulating embedded systems before deploying them using DEVS formalism.","content":"# What was your internship about, and what was the duration of it ?\n\nMitacs Globalink Research Internship is a competitive initiative for international undergraduates from the following countries and regions: Australia, Brazil, China, Colombia, France, Germany, Hong Kong, India, Tunisia, Ukraine, United Kingdom and the United States. From May to October of each year, top-ranked applicants participate in a 12-week research internship under the supervision of Canadian university faculty members in a variety of academic disciplines, from science, engineering, and mathematics to the humanities and social sciences.\n\n# How do you approach the Organization/University ?\n\nYou need to apply through the [MITACS portal](https://www.mitacs.ca/en/programs/globalink/globalink-research-internship). I worked with Carleton University ([Prof. Gabriel Wainer](https://carleton.ca/sce/people/wainer/))\n\n# What was your project about ?\n\nI worked with [Advanced Real-time simulation Lab (ARS Lab)](https://arslab.sce.carleton.ca/), they have a event base simulation framework called Cadmium based on DEVS formalism. I worked on simulating an embedded system on it and then actually verifying the behaviour on real hardware. The model implements a complementary filter algorithm to fuse readings from gyroscope and accelerometer. To introduce redundancy, it utilizes five IMU sensors, Majority vote algorithm decides an appropriate reading from the five sensors, which is given to the complimentary filter. Then Simulated this using Cadmium and verified it on STM32 Nucleo-F401R developer kit using mbed-os.\n\n# How was the host University in terms of research and campus life ?\n\nIt was a remote internship due to Covid 19, but I had weekly meetings with my PhD advisor. Other than that there were some fun events as well.\n\n# How much was your stipend ?\n\nIt was around 70k because it was online. For offline everything is paing starting from your flight tickets to your stay.\n\n# Can you provide any resources to check out your project ?\n\nHere is the project report: https://drive.google.com/file/d/1e9wVs48T95dMAKHxLRLMfWLH6zLHmqdG/view\n\n# Suggestions to the fellow VJTIians who want to go for this internship.\n\nChoose your project and mentor correctly through the list of more than 2000 projects. Look at their past interns and publications. If the professor is actively publishing and the past interns profile matches with yours then it is a positive sign.\n\nThere is no letter of motivation for this internship. Your selling point is your resume. You can even start emailing the professors before hand. The more experience you have, the better. I would suggest people to do at least some internship after 2nd year instead of wasting their summer. Also it is possible to work within semesters so try to explore the things that you like by doing a project/ internship etc. as college is not going to teach you anything good.\n\n# What is the best way to contact you ?\n\nYou can contact me at my email, [vedantparanjape160201@gmail.com](mailto:vedantparanjape160201@gmail.com)\n"},"__N_SSG":true}