{"pageProps":{"photo":"/static/images/Team/Shantanu.jpg","title":"Airpix","author":"Shantanu Pande","time":"June-Sept 2020, Feb-July 2021","short":"Collected and Annotated large datasets for custom object detection such as helmets, guns.","content":"# What was your internship about, and what was the duration of it ?\n\n[Airpix](https://airpix.in/) is a drone / unmanned aerial systems startup based in Navi Mumbai, India.[Airpix.io](https://airpix.io/) is an analytics platform that provides services in face recognition, video analytics, optical character recognition by Leveraging AI, Machine Learning &amp; Deep Learning technologies.[AIsyte](https://aisyte.com/) is the product that provides these analytics services.\n\nMy position in internship was 'AI ML and Edge Computing Intern'. The tasks were related to developing applications for Traffic monitoring, Face recognition, Pose estimation, etc. The position required knowledge in Python, Numpy, OpenCV, Deep Learning frameworks like Tensorflow, Keras, Pytorch, etc. It started with a 3 months unpaid internship. After that, I was offered a paid internship . I worked under the guidance of Aniket Tatipamula Sir.\n\n# How do you approach the Organization/University ?\n\nThe application form was sent by my college. But you can also reach out to them via email or linkedin.\n\n# What was your project about ?\n\nIn the first 3 months, we were divided into groups to tackle different problems. I was part of the group -Bank Safety. Initially the tasks involved collecting and annotating large datasets for custom object detection such as helmets, guns. In the initial few weeks we were made familiar with different detectors such as YOLO, SSD and their implementations on pytorch and darknet. After the custom detection part that main job revolved around detecting suspicious activities which was done using pose detectors along with LSTM to get accurate results.\n\nThe second half of the internship dealt with working on the traffic monitoring framework which was developed earlier by a team. This module was to be integrated along with the web app as well, so for this the earlier code was to be cleaned and separated into different modules and later multiprocessing was implemented to run different analytics separately. After this, a major task revolved around deploying this application on Nvidia edge (jetson) devices and obtaining optimised and efficient results with better performance. My further work on this project is underway.\n\n# How was the host in terms of research and campus life ?\n\nRemote internship due to pandemic, N/A\n\n# How much was your stipend ?\n\nConfidential\n\n# Can you provide any resources to check out your project ?\n\nConfidential\n\n# Suggestions to the fellow VJTIians who want to go for this internship.\n\nThis internship has some basic technical prerequisites along with the will to work efficiently and with dedication. The team at Airpix is really good to work with and one can get a very good industrial exposure in the field of AI, ML and video analytics.\n\n# What is the best way to contact you ?\n\nLinkedIn:[linkedin.com/in/shantanu-pande](https://in.linkedin.com/in/shantanu-pande)\n\nEmail: shantanupande898@gmail.com\n"},"__N_SSG":true}