{"pageProps":{"photo":"/static/images/Team/Vedant.jpg","title":"GSoC 2021 with LibCamera","author":"Vedant Paranjape","time":"May - September 2021","short":"Worked on adding multi-stream support to the gstreamer element.","content":"# What was your internship about, and what was the duration of it ?\n\nGoogle summer of code is an international, annual program in which Google awards stipends to students who successfully complete a free and open-source software coding project during the summer. I was working with libcamera, which is an open source camera stack and framework for Linux, Android, and ChromeOS. It was a 10 week long program.\n\n# How do you approach the Organization/University ?\n\nI joined their IRC channel, and communicated with my mentors about my interest in the\n\nproject, then one has to sign up with GSoC portal, and upload the project proposal for the specific project, which would be then reviewed by the organization.\n\n# What was your project about ?\n\nLibcamera is a camera stack which aims to make using camera's easy on various hardware, it aims to be a standard library for handling camera's and provides a way for manufacturers to use their own firmware as the building block for libcamera. There are multiple ways to interact with the libcamera, one of them is to use gstreamer element for libcamera. The GStreamer libcamera element allows libcamera to be used in GStreamer pipelines. libcamera supports simultaneous streaming, for example having lower quality one stream for preview, while another higher quality one is used for recording. Currently, the element doesn't support multi-stream output, so I worked on adding multi-stream support to the gstreamer element.\n\n# How was the host University in terms of research and campus life ?\n\nIt was remote, N/A\n\n# How much was your stipend ?\n\nIt was $1500 divided into 2 evaluations.\n\n# Can you provide any resources to check out your project ?\n\nHere's my project report: [https://github.com/VedantParanjape/gsoc2021/wiki](https://github.com/VedantParanjape/gsoc2021/wiki)\n\nHere's my project repository: [https://git.libcamera.org/libcamera/libcamera.git/](https://git.libcamera.org/libcamera/libcamera.git/)\n\n# Suggestions to the fellow VJTIians who want to go for this internship.\n\nStart early, join the organization's communication channel from January itself, and start contributing to their projects, take part in meetings and interact with the possible mentors. You need to prove the mentors that you are capable of doing the given project.\n\n# What is the best way to contact you ?\n\nYou can contact me at my email, [vedantparanjape160201@gmail.com](mailto:vedantparanjape160201@gmail.com)\n"},"__N_SSG":true}