{"pageProps":{"photo":"/static/images/Team/Sravan.jpeg","title":"MITACS GRI 2021 @ University of Dalhousie","author":"Sravan Chittupalli","time":"May - August 2021","short":" Developed a Deep Learning System that can detect and count the number of strawberries (ripe, unripe) in the strawberry field and then predict the yield accordingly ","content":"# What was your internship about, and what was the duration of it ?\n\nMitacs Globalink Research Internship is a competitive initiative for international undergraduates from the following countries and regions: Australia, Brazil, China, Colombia, France, Germany, Hong Kong, India, Tunisia, Ukraine, United Kingdom and the United States. From May to October of each year, top-ranked applicants participate in a 12-week research internship under the supervision of Canadian university faculty members in a variety of academic disciplines, from science, engineering, and mathematics to the humanities and social sciences.\n\n# How do you approach the Organization/University ?\n\nYou need to apply through the [MITACS portal](https://www.mitacs.ca/en/programs/globalink/globalink-research-internship).\n\n# What was your project about ?\n\nThe main aim of my project was to develop a Deep Learning System that can detect and count the number of strawberries (ripe, unripe) in the strawberry field and then predict the yield accordingly. Then a scalable website was made which accepts a video file as input and the real time count of the strawberries in the video can be seen.\n\n# How was the host University in terms of research and campus life ?\n\nIt was a remote internship but my professor said that Dalhousie university is focused on research and they own a whole farming hill just to perform research. Many professors there are pursuing research. After my internship I was even offered to work as a visiting researcher.\n\n# How much was your stipend ?\n\nIt was around 70k because it was online. For offline everything is paing starting from your flight tickets to your stay. Also, you get some stipend on top of that.\n\n# Can you provide any resources to check out your project ?\n\nThe project is not currently open sourced. If ever it becomes open sourced that I will put up a link here.\n\n# Suggestions to the fellow VJTIians who want to go for this internship.\n\nChoose your project and mentor correctly through the list of more than 2000 projects. Look at their past interns and publications. If the professor is actively publishing and the past interns profile matches with yours then it is a positive sign.\n\nThere is no letter of motivation for this internship. Your selling point is your resume. The more experience you have, the better. I would suggest people to do at least some internship after 2nd year instead of wasting their summer. Also it is possible to work within semesters so try to explore the things that you like by doing a project/ internship etc. as college is not going to teach you anything good.\n\n# What is the best way to contact you ?\n\nYou can contact me at my email, [sravanchittupalli7@gmail.com](mailto:sravanchittupalli7@gmail.com)\n"},"__N_SSG":true}