{"pageProps":{"photo":"/static/images/Team/2024/Rishikesh_Donadkar_2024.jpg","title":"Google Summer of Code with libcamera","author":"Rishikesh Donadkar","time":"June 2022 - September 2022","short":"The project I worked on was Improving the gstreamer element to add support for properties.","content":"# What was your internship about, and what was the duration of it ?\n\nGoogle Summer of Code is an international, annual program in which Google awards stipends to students who successfully complete a free and open-source software coding project during the summer. I worked with libcamera which is an open source camera stack library that supports embedded cameras on various platforms like Linux, Windows, and Chrome OS.\n\n# How do you approach the Organization/University ?\n\nI approached the organization through their official IRC and mailing list. I posted a message introducing myself and the project I was interested in. In the application period I prepared a proposal and applied on the GSoC portal. The proposal was accepted by the organization.\n\n# What was your project about ?\n\nThe project I worked on was Improving the gstreamer element to add support for properties. Gstreamer is a pipeline based multimedia framework and libcamera offers a video source element that acts as a video source in the pipeline. My project was based on adding support for colorimetry negotiation and framerate negotiation and control in the libcamera gstreamer element. Writing code to manage negotiation between libcamerasrc and neighboring gstreamer elements, controlling framerate, and modifying libcamera ColorSpace in accordance with peer elements' preferences were the main focuses of my work.\n\n# How was the host University in terms of research and campus life ?\n\nGSoC is an open source initiative that operates entirely online. Libcamera is a really good organization in terms of support. The organization's mentors and administrators provide new open source contributors with a lot of assistance as they become accustomed to how open source communities operate.\n\n# How much was your stipend ?\n\n$1500 in 2 evaluations of 45% (week 6) and 55% (week 12) payment\n\n# Can you provide any resources to check out your project ?\n\nMidway blog : https://rishi27-dot.github.io/midway_blog/home/\nFinal Report : https://rishi27-dot.github.io/final_report/home/\nGSoC2022 : https://summerofcode.withgoogle.com/programs/2022/projects/WyqdLcia\n\n# Suggestions to the fellow VJTIians who want to go for this internship.\n\nGSoC is a very prestigious open source program where they will have the opportunity to learn a lot and network with the best open source developers in the world. In open source communities, communication is crucial. Discuss your questions, concerns, and comments with the org admins and maintainers about the code or project you wish to work on during Google Summer of Code. Avoid sending out emails and communications that are overly wordy; instead, keep them short and to the point.\n\n# What is the best way to contact you ?\n\nYou can contact me at my email, [rishikeshdonadkar@gmail.com](mailto:rishikeshdonadkar@gmail.com)\n"},"__N_SSG":true}