{"pageProps":{"photo":"/static/images/Team/Abhinav.jpg","title":"GSOC 2022 @ INCF","author":"Abhinav Venkadatri","time":"May 2022 - Sept 2022","short":"My project was about replicating Google’s implementation of the Paper titled “ Accelerating eye movement research via accurate and affordable smartphone eye tracking”.","content":"# What was your internship about, and what was the duration of it ?\n\nGoogle Summer of Code is a global, online program focused on bringing new contributors into open source software development. GSoC Contributors work with an open source organization on a 12+ week programming project under the guidance of mentors.\n\n# How do you approach the Organization/University ?\n\nApproached them on Neurostars. The links was provided once the orgs where shortlisted.\n\n# What was your project about ?\n\nMy project was about replicating Google’s implementation of the Paper titled “ Accelerating eye movement research via accurate and affordable smartphone eye tracking”. I had an opportunity to interact with people from Google who were the authors of the paper. The project was done using pytorch the previous year and the accuracy was not similar to what the google had reported. Hence, we worked on the implementation in Tensorflow and the hyper parameter tuning. I personally worked on the tuning part and SVR implementation. Google used a unique approach which I personally had not come across before. They extracted the value of the model from the penultimate layer and used this to compare with the complete model. SVR was applied on the penultimate layer and surprisingly( initially is quite intriguing) performed much better. Different parameters were also tuned while implementing the SVR. We had also created an app for collection of data. This part of using the data for fine-tuning the model is remaining and would be completed in the next GSoC phase.\n\n# How was the host University in terms of research and campus life ?\n\nGSoC is remote program.\n\n# How much was your stipend ?\n\n$3000 in 2 evaluations of 45% (week 6) and 55% (week 12) payment\n\n# Can you provide any resources to check out your project ?\n\nSure. Here you go:\n\n[https://abhinavvenkatadri.github.io/Eye-tracking-GSoC/](https://abhinavvenkatadri.github.io/Eye-tracking-GSoC/)\n[https://dssr2.github.io/gaze-track/](https://dssr2.github.io/gaze-track/)\n[https://ai.googleblog.com/2021/05/accelerating-eye-movement-research-for.html](https://ai.googleblog.com/2021/05/accelerating-eye-movement-research-for.html)\n[https://www.nature.com/articles/s41467-020-18360-5#data-availability](https://www.nature.com/articles/s41467-020-18360-5#data-availability)\n\n# Suggestions to the fellow VJTIians who want to go for this internship.\n\nGo for orgs like INCF who select a lot of students( 40 in the past year), if you are new to GSoC and this is your first attempt. Regularly interact with the mentors. Try approaching them even before the orgs list appear on the GSoC portal\n\n# What is the best way to contact you ?\n\nYou can contact me at my email, [ abhinavvenkatadri@gmail.com](mailto:abhinavvenkatadri@gmail.com)\n\nConnect with me on LinkedIn [https://www.linkedin.com/in/abhinavvenkatadri/](https://www.linkedin.com/in/abhinavvenkatadri/)\n"},"__N_SSG":true}