{"pageProps":{"photo":"/static/images/Team/2023/Saad_Hashmi.jpg","title":"Stoch Lab IISc","author":"Saad Hashmi","time":"December 2021 - March 2022","short":"Create prototype for Contact Sensing Foot, improved design of original Foot, designed heat sink, solving overheating problems.","content":"# What was your internship about, and what was the duration of it ?\n\nMy Internship was at Stochastic Robotics Labs at Indian Institute of Science Bangalore. This lab focuses on areas such as Legged Robotics (Quadrupeds and Bipeds), robust locomotion and Reinforcement Learning for the same. They have developed a lot of quadrupeds such as Stoch, Stoch 2, Stoch 3, Stoch Mini. I had interned at the lab for 4 months (1 month Offline and 3 months Online).\n\n# How do you approach the Organization/University ?\n\nI Contacted the Lab at [stochlab@iisc.ac.in](stochlab@iisc.ac.in). The professor of the lab then directly scheduled an interview for the same. The Lab has open positions for Mechanical Design, Control Theory, and Embedded Systems.\n\n# What was your project about ?\n\nI was involved in the mechanical team. Our work was divided into different problem statements. The first problem statement was creating a prototype of a Contact Sensing Foot required for contact estimation in uneven terrains. We improved the design on the original foot and created multiple prototypes using a soft material (TPU) for the same. We used FSR (Force Sensing Resistor) for contact estimation using change in resistance. Then tested the designed foot using a basic arduino circuit and calibrated the data received to also estimate the force exerted on the foot. The second problem was with the motor driver of the quadruped where because of the motor driver overheating the quadruped could only operate for a very short duration. I designed a heat sink keeping in mind the manufacturing processes such as Laser cutting and CNC machining. I used Ansys of Heat Flow Analysis and attained a temperature reduction of 30 degree Celsius.\n\n# How was the host University in terms of research and campus life ?\n\nI got the opportunity to work in the Physical Mode for the first month at IISc Bangalore. There are a plethora of areas where research is going on at StochLab such as Quadrupeds, Bipeds, and Reinforcement Learning. I interacted with a lot of fellow students and Professors there which was a great experience.\n\n# How much was your stipend ?\n\nN/A, StochLabs is a Government Funded Lab, so there are no stipends for interns, but there are full time positions offered at the Lab.\n\n# Can you provide any resources to check out your project ?\n\nN/A\n\n# Suggestions to the fellow VJTIians who want to go for this internship.\n\nFirst of all, if you want to go for the Mechanical Design Side of the lab, you must have ample experience in Design prototyping of components (using SolidWorks and Ansys) and also strong mechanical Concepts. For the software side you must have good experience in ROS or Control Theory. For the embedded Side you must have experience in working with RasberryPi. Also Contact Prof Shishir NY Kolathaya Directly at [shishirk@iisc.ac.in](shishirk@iisc.ac.in) for a faster response.\n\n# What is the best way to contact you ?\n\nYou can contact me at my email, (hashmis104@gmail.com) or LinkedIn (https://www.linkedin.com/in/saad-hashmi-01722218b/)\n"},"__N_SSG":true}