{"pageProps":{"photo":"/static/images/Team/Sravan.jpeg","title":"Airpix","author":"Sravan Chittupalli","time":"June 2020 - April 2021","short":"Trained a model which can detect, classify and localise Indian vehicles.","content":"# What was your internship about, and what was the duration of it ?\n\n[Airpix](https://airpix.in/) is a drone / unmanned aerial systems startup based in Navi Mumbai, India. [Airpix.io](https://airpix.io/) is an analytics platform that provides services in face recognition, video analytics, optical character recognition by Leveraging AI, Machine Learning &amp; Deep Learning technologies. [AIsyte](https://aisyte.com/) is the product that provides these analytics services.\n\nMy position in internship was 'AI ML and Edge Computing Intern'. The tasks were related to developing applications for Traffic monitoring, Face recognition, Pose estimation, etc. The position required knowledge in Python, Numpy, OpenCV, Deep Learning frameworks like Tensorflow, Keras, Pytorch, etc. It started with a 3 months unpaid internship. After that I was given the opportunity to continue the work with a paid internship. I worked under the guidance of Aniket Tatipamula.\n\n# How do you approach the Organization/University ?\n\nThe application form was sent by my college. But you can also reach out to them via email or linkedin.\n\n# What was your project about ?\n\nDuring the summer of 2020 I worked with the vehicle classification group. The task was to train a model which can detect, classify and localise Indian vehicles. Also the detected vehicles have to be tracked and counted. Further the Indian trucks had to be sub-classified according to the number of axles.\n\nFor this task our team was given a week to do literature review and get familiar with training and using YOLO, SSD models. Firstly a dataset of Indian vehicles was made and a YOLO model was trained. After training the task was to get inference and check the accuracy of the model. The next task was to track the vehicles to count them. Different trackers like KCF, CSRT, median flow etc were explored and later we used SORT tracker for tracking. For sub-classifying trucks a lightweight model was trained.\n\nThe second task was to detect speed violations in a video. A report had to be generated and statistics had to be shown. This was a requirement by a client so specific analytics had to be calculated which cannot be disclosed.\n\nWeekly meetings took place and during that time the mentor discussed the work done during the week and pointed us towards the right direction whenever we were struck.\n\nAfter this my internship was extended and I was working during the semester. The task was to create a product so that the client can detect specific violations in a rtsp stream/ a video file. It was basically a culmination of the tasks that were done by the vehicle classification and the violation detection team. This product was to be deployed on an edge device. Also, the product had to be made such that it can run on all devices irrespective of the configuration.\n\n# How was the host University in terms of research and campus life ?\n\nIt was a remote internship due to COVID.\n\n# How much was your stipend ?\n\nConfidential\n\n# Can you provide any resources to check out your project ?\n\nConfidential\n\n# Suggestions to the fellow VJTIians who want to go for this internship.\n\nMost probably you will receive the application form. If not then find the email on AIRPIX website and mail them. Remember: &quot;_You get what you ask_&quot;\n\n# What is the best way to contact you ?\n\nEmail: [sravanchittupalli7@gmail.com](mailto:sravanchittupalli7@gmail.com)\n"},"__N_SSG":true}