{"pageProps":{"photo":"/static/images/Team/Sanath.jpeg","title":"Orangewood Labs","author":"Sanath Menon","time":"May - July 2021","short":"Worked on the Software Aspects of the 5 Dof Robotic Arm and also created the online interfaces to teleoperate the Arm from any city in the world","content":"# What was your internship about, and what was the duration of it ?\n\nOrangewood Labs is a design-led and a Y Combinator backed tech startup based out of San Francisco and Noida founded by Mr Abhinav Das and Mr Akash bansal..Their aim is to build affordable robotic arms for SMEs.I was a Software Intern working on research and development on their industry standard 5 Dof Robotic Arm.We also had to make useful and innovative modifications to the software aspects of the arm for ease of use in Industries.\n\n# How do you approach the Organization/University ?\n\nThey had put up various offers on [NextGig](https://thenextgig.net/) and other websites as the company\n\nwas increasing its workforce on a large scale.I approached Nextgig and they connected me with the company for the interview and selection process.\n\n# What was your project about ?\n\nWe had to work on the Software Aspects of the 5 Dof Robotic Arm.Initially,there was a bit of training to get us up to speed with the project.I worked on Cartesian Trajectory Planning for their arm using ROS ,gazebo and Moveit.Trajectories for performing welding/soldering using the arm were planned.I also worked on creating online interfaces to teleoperate the Arm from any city in the world.Various other interfaces for error detection and reporting were also planned. Research on future upgrades to integrate Robotic Arms With Virtual Reality Using Unity was also carried out.\n\n# How was the host University in terms of research and campus life ?\n\nThe internship was done from home.Work on the Arm was done via teleoperation.A fun Hackathon to bond with the team members was also organized!\n\n# How much was your stipend ?\n\nThe stipend was 20000 for 2 months with an option to receive in cash/stock option\n\n# Can you provide any resources to check out your project ?\n\nThis is the link of the company website where u can see the pictures and tech specs of their robotic arm- [https://orangewood.co/](https://orangewood.co/)\n\n# Suggestions to the fellow VJTIians who want to go for this internship.\n\nLook up for their Internship Offers on third party Websites or contact them directly.They are always looking for Interns who have an interest in the field of Robotics.\n\n# What is the best way to contact you ?\n\nYou can contact me at my email,[sanathmenons@gmail.com](mailto:sanathmenons@gmail.com)\n"},"__N_SSG":true}