{"pageProps":{"photo":"/static/images/Team/Vishnu.png","title":"SRFP with NPL, New Delhi","author":"Vishnu Parammal","time":"May-July 2019","short":"Automated the process of calibration to reduce time and errors","content":"# What was your internship about, and what was the duration of it ?\n\nSummer Research fellowship programme is an annual fellowship provided by the three national Science Academies — Indian Academy of Sciences, Bengaluru, Indian National Science Academy, New Delhi and The National Academy of Sciences, India, Prayagraj. They offer several two-month Summer Fellowships to enable students/​teachers (studying/​teaching in India) to work with scientists associated with the three Academies. Internship opportunities are available across various government labs and institutions throughout India in the following fields.\n\n- Life Sciences\n- Engineering Sciences\n- Chemical Sciences\n- Physical Sciences\n- Materials Sciences\n- Mathematics\n\nDuration: 8 weeks\n\n# How do you approach the Organization/University ?\n\nThe application will be available on [https://www.ias.ac.in/](https://www.ias.ac.in/) during october/november. The list of all available institutions, along with the list of professors/scientists and their field of expertise will be given for you to choose. Criteria for selection includes your statement of purpose, scores of 10, 12, and engineering.\n\n# What was your project about ?\n\nInstruments used for measurement of voltage, current, power and resistance have to be precise, accurate and must comply with international regulations for measurement. In order to achieve this high measurement quality, every country has to maintain certain standards. For AC standards, India uses electrothermic instruments. Regular calibration of these instruments are of utmost importance to maintain the national standard. But the process is time consuming if done manually. My project was to automate the process of calibration which will reduce time and remove errors when compared with the conventional method.\nI had to develop a LabVIEW program to automate the AC DC transfer difference method of calibration and generate reports based on the result\n\n# How was the host University in terms of research and campus life ?\n\nThe National Physical Laboratory had many research activities going on during my time of visit, some of the interesting ones included finding materials with electrical properties similar to human skin and tissues, research on improving NTP(Network Time Protocol), designing of 5G antennae, etc. They have their own journals and conferences for metrology which demonstrates their research.\nIt has a really vibrant campus lush with greenery and regular sights of peacocks roaming around. Living arrangements have to be done by the students themselves.\n\n# How much was your stipend ?\n\nRs. 22,500 per month\n\n# Can you provide any resources to check out your project ?\n\nYou may visit [http://reports.ias.ac.in/](http://reports.ias.ac.in/) to check out all projects done under SRFP\n\nLink to my [project report](http://reports.ias.ac.in/report/20047/development-and-implementation-of-automation-software-for-calibration-of-reference-and-transfer-standards-for-lf-voltage-and-current-using-labview-platform)\n\n# Suggestions to the fellow VJTIians who want to go for this internship.\n\nThis internship will be appropriate for 2nd year students who would like to have an exposure to the government labs in India.\n\n# What is the best way to contact you ?\n\nEmail: [vishnu.130599@gmail.com](mailto:vishnu.130599@gmail.com)\n"},"__N_SSG":true}