{"pageProps":{"photo":"/static/images/Team/OmkarB.jpg","title":"SHAKTI, RISE Group, IIT Madras","author":"Omkar Bhilare","time":"Mar - July 2021","short":"Designed and developed a FPGA framework to verify the SHAKTI processors on the FPGAs","content":"# What was your internship about, and what was the duration of it ?\n\nSHAKTI is an open-source initiative by the Reconfigurable Intelligent Systems Engineering group at Indian Institute of Technology, Madras to develop the first indigenous Indian industrial-grade processor. They had already tapeout Moushik, RISECREEK, RIMO processors from SCL and intel foundries. These processors were based on the C and E classes of SHAKTI. Shakti is now going to tapeout the new I class. My project was based primarily on FPGA Based verification of SHAKTI processors. For selected Interns the duration usually depends on project complexity and current need of the Lab. I had interned at SHAKTI Lab for 5 months.\n\n# How do you approach the Organization/University ?\n\nYou can apply on the Shakti site: [https://shakti.org.in/jobs.html](https://shakti.org.in/jobs.html). A former verification team member of shakti referred me to the verification team leader. After that, interviews happened. Shakti usually has open positions related to physical design, verification and software.\n\n# What was your project about ?\n\nC-Class is a member of the SHAKTI family of processors. It is an extremely configurable and commercial-grade 5-stage in-order core supporting the standard RV64GCSUN ISA extensions. Verification is a very important process in chip design. Usually, the software RTL simulation tests on host computers take a very large amount of time. My project explores the possibility of FPGA-based verification of SHAKTI processors to reduce verification time. AAPG is a tool that is intended to generate random RISC-V programs to test RISC-V cores. In this project, I ran AAPG tests on an FPGA and compared the spike's golden signature dump with the FPGA signature dump. The project also explores the self checking tests generated by AAPG. Self-checking tests have the advantage of running on FPGA or silicon without much intervention from the host, thereby accelerating the speed verification significantly.\n\nMore Info can be found here: [https://omkarbhilare.tech/pdf/SHAKTI_REPORT.pdf](https://omkarbhilare.tech/pdf/SHAKTI_REPORT.pdf)\n\n# How was the host University in terms of research and campus life ?\n\nIt was remote, but usually interns can directly come to SHAKTI Lab and work there itself.\nSHAKTI has good connections with industry and other VLSI research groups like OPENHW. In my project, I had done various literature surveys.\n\n# How much was your stipend ?\n\nN/A\nSHAKTI is government funded LAB, for internships there is no stipend but there are full time positions offered at LAB.\n\n# Can you provide any resources to check out your project ?\n\nMore Info can be found here: [https://omkarbhilare.tech/pdf/SHAKTI_REPORT.pdf](https://omkarbhilare.tech/pdf/SHAKTI_REPORT.pdf)\n\n# Suggestions to the fellow VJTIians who want to go for this internship.\n\nFirst of all keep doing projects in digital design and verification, most of the time previous projects/work experiences are looked for selection. First apply on the shakti site then try to get a referral from a former team member of shakti.\n\n# What is the best way to contact you ?\n\nYou can contact me at my email, [oabhilare_b19@el.vjti.ac.in](mailto:oabhilare_b19@el.vjti.ac.in)\n"},"__N_SSG":true}