{"pageProps":{"photo":"/static/images/Team/2024/Krishna_Narayanan_24.jpg","title":"Google Summer of Code with BeagleBoard.Org","author":"Krishna Narayanan","time":"June 2022 - September 2022","short":"Adding features and more compatibility for simpPRU was the main aim of the project.","content":"# What was your internship about, and what was the duration of it ?\n\nGoogle Summer of Code is a global, online program focused on bringing new contributors into open source software development. GSoC Contributors work with an open source organization on a 12+ week programming project under the guidance of mentors. I was working with BeagleBoard.Org for the project idea of Adding features to simpPRU.\n\n# How do you approach the Organization/University ?\n\nGSoC is an open source student program where students from all over the world participate by submitting proposals for projects they are interested in. Every org participating in GSoC will have an ideas page with many prospect ideas, also some unfinished ideas(or ideas requiring enhancement) from previous GSoC. Some orgs have you commit some code my creating a Pull Request(PR), some have you solve tasks, some may have no necessary criteria except for a proposal. The aspect common to all orgs/mentors is showing your enthusiasm for the project, and to learn. Also having a few(or even one in my case) commits to the org before submitting the proposal will go a long way.\n\n# What was your project about ?\n\nBuilding upon the work done in GSoC 2021 to make programming the PRU easier for beginners, adding features and more compatibility for simpPRU was the main aim of the project.I have added assignment, bitwise operators which increase the efficiency of usage and write test cases for it, adding the compiler flags for generated C code and document their outcomes,the python test is added to GitHub actions for testsuite,I have added support for return statements,calling C from simpPRU,enhance error handling in parser,adding additional test cases for the features present.This will make the overall language more robust and efficient, which will help beginners who are learning to use the PRU or experienced users prototyping something on the PRU.\n\n# How was the host University in terms of research and campus life ?\n\nGSoC is remote program.I had done with BeagleBoard.Org which is a excellent community to work with.It is one of the finest hardware oriented organizations participating in GSoC and the community is really supportive.The Wednesday meeting were held to keep a track of the GSoC contributors and their pace,progress with respect to the timeline.\n\n# How much was your stipend ?\n\n$3000 in 2 evaluations of 45% (week 6) and 55% (week 12) payment\n\n# Can you provide any resources to check out your project ?\n\nGSoC Project Page : https://summerofcode.withgoogle.com/programs/2022/projects/atWuie8j\nProject GitHub : https://github.com/VedantParanjape/simpPRU\nProject Final Report : https://github.com/Krishna-13-cyber/simpPRU/wiki\n\n# Suggestions to the fellow VJTIians who want to go for this internship.\n\nStart pondering upon the Organizations,projects which are inclined towards your techstack and you are familiar with.Always keep a backup which is very important because even if the first choice gets rejected by any means you definitely have the other in hand.In the GSoC period try to maintain and be in pace with proposed timeline.\n\n# What is the best way to contact you ?\n\nYou can contact me at my email, [krishnanarayanan132002@gmail.com ](mailto:krishnanarayanan132002@gmail.com)\n"},"__N_SSG":true}