{"pageProps":{"photo":"/static/images/Team/2024/Pratham_Shah_24.jpeg","title":"Google Summer of Code with Forschungszentrum Jülich","author":"Pratham Shah","time":"June 2022 - September 2022","short":"My project was about creating an algorithm to perform convolutions on fully memory-distributed data.","content":"# What was your internship about, and what was the duration of it ?\n\nGoogle Summer of Code is a global, online program focused on bringing new contributors into open source software development. GSoC Contributors work with an open source organization on a 12+ week programming project under the guidance of mentors. I was working with Forschungszentrum Jülich which is a part of the Helmholtz Association.\n\n# How do you approach the Organization/University ?\n\nGSoC is an open source student program where students from all over the world participate by submitting proposals for projects they are interested in. Every org participating in GSoC will have an ideas page with many prospect ideas, also some unfinished ideas(or ideas requiring enhancement) from previous GSoC. Some orgs have you commit some code by creating a Pull Request(PR), some have you solve tasks, some may have no necessary criteria except for a proposal. The aspect common to all orgs/mentors is showing your enthusiasm for the project, and to learn. Also having a few(or even one in my case) commits to the org before submitting the proposal will go a long way.\n\n# What was your project about ?\n\nMy project was about creating an algorithm to perform convolutions on fully memory-distributed data. Heat's current implementation of 1D and 2D convolution only supports convolutions on one distributed DNDarray, the signal, with a non-distributed DNDarray, the filter. However, because the user-defined procedure involves a 2D convolution of a large matrix with its own boolean mask, we need both the signal and the kernel to be distributed in memory. As a result, I had to create a new method to distribute the convolution operation using MPI.\n\n# How was the host University in terms of research and campus life ?\n\nGSoC is remote.\n\n# How much was your stipend ?\n\n$3000 in 2 evaluations of 45% (week 6) and 55% (week 12) payment\n\n# Can you provide any resources to check out your project ?\n\nMy project report is available at, https://gist.github.com/shahpratham/73478f6f26873fe2f10c4446e3ab89d0. You can also look at this https://nyu-cds.github.io/python-mpi/ for a quick guide to dealing with distributed memory with MPI.\n\n# Suggestions to the fellow VJTIians who want to go for this internship.\n\nStart early. Find relevant orgs and join their IRC as soon as possible and start communicating and contributing to relevant org issues. Start working on your project as soon as possible. Maintain good communication with your mentor and keep them up to date.\n\n# What is the best way to contact you ?\n\nppsprathamshah2313@gmail.com or https://www.linkedin.com/in/shahpratham/\n"},"__N_SSG":true}