{"pageProps":{"photo":"/static/images/Team/2023/Shreyas_Atre.jpg","title":"GSoC @ STE||AR Group, HPX ","author":"Shreyas Atre","time":"June 2022 - September 2022","short":"My project is about the Senders and Receivers Proposal P2300 of the ISO C++ Community which is about to be accepted into C++26. It is a generalized programming model for synchronous and asynchronous programming.","content":"# What was your internship about, and what was the duration of it ?\n\nParticipated in Google Summer of Code 2022 as a student. The project was to implement a coroutine interface for the P2300 facilities provided by HPX.\n\n# How do you approach the Organization/University ?\n\nApproach the mentors on IRC. Question about the project in a smart way.\n\n# What was your project about ?\n\nMy project is about the Senders and Receivers Proposal P2300 of the ISO C++ Community which is about to be accepted into C++26. It is a generalized programming model for synchronous and asynchronous programming. It takes into consideration both - concurrency and parallelism. Some of the facilities proposed in this paper are already implemented in HPX. However a major part of it was remaining which is the coroutine integration. This project aimed at completing the coroutine support for the HPX S/R.\n\n# How was the host University in terms of research and campus life ?\n\nThe organization is STE||AR Group at Louisiana State University. An uplifting and chill environment.\n\n# How much was your stipend ?\n\n$3000 in 2 evaluations of 45% (week 6) and 55% (week 12) payment\n\n# Can you provide any resources to check out your project ?\n\nCheck [this](https://gist.github.com/SAtacker/38e8fc1c386fab3566f9e008bcf727e0) final report.\n\n# Suggestions to the fellow VJTIians who want to go for this internship.\n\nBe thorough with C++. (Please don’t consider yourself a C++ programmer if all you do is use external library APIs and don’t know template metaprogramming)\n\n# What is the best way to contact you ?\n\nIf you are not on discord - shreyasatre16@gmail.com\n"},"__N_SSG":true}