{"pageProps":{"photo":"/static/images/Team/2023/ninadgsoc.jpg","title":"MITACS GRI 2022 @ University of Quebec at Chicoutimi","author":"Ninad Jangle","time":"May 2022 - August 2022","short":"The goal of this project was to develop a test platform for RISC-V processors on FPGAs dedicated to artificial intelligence at the edge.","content":"# What was your internship about, and what was the duration of it ?\n\nMitacs Globalink Research Internship is a competitive initiative for international undergraduates from the following countries and regions: Australia, Brazil, Chile, China, Colombia, France, Germany, Hong Kong, India, Mexico, Pakistan, South Korea, Taiwan, Tunisia, Ukraine, United Kingdom and the United States. From May to October of each year, top-ranked applicants participate in a 12-week research internship under the supervision of Canadian university faculty members in a variety of academic disciplines, from science, engineering, and mathematics to the humanities and social sciences.\n\n# How do you approach the Organization/University ?\n\nYou need to apply through the MITACS portal. Applications open around July - August.\nhttps://www.mitacs.ca/en/programs/globalink/globalink-research-internship\n\n# What was your project about ?\n\nThe goal of this project was to develop a test platform for RISC-V processors on FPGAs\ndedicated to artificial intelligence at the edge. First, a state-of-the-art study was to be done.\nThen, different techniques will be tested on FPGA. The results of this project could\neventually lead to the fabrication of an integrated circuit with commercial technology\navailable to Canadian researchers.\nCarry out a review of the literature on RISC-V, FPGA and AI\n\n- Design a digital system using VHDL, Verilog or SystemVerilog.\n- Simulate the system using the tools provided for this purpose.\n- Test the system on FPGA.\n  I personally worked with the chipyard framework from ucb to emulate accelerators and integrate with RISC V Cores on an SoC\n\n# How was the host University in terms of research and campus life ?\n\nUQAC has a very easygoing environment, with regards to campus life. There are huge labs for material sciences and is one of the vital Aluminium Research locations in North America. It is very new in terms of VLSI research but I would really recommend it for climate and material research.\nThe labs are operational 24\\*7, there is full freedom and open access to resources. It was one of the best experiences to work there in my life.\n\n# How much was your stipend ?\n\nThe total compensation included shares for flight tickets, visa, accommodation, food and institute fees which was about 8800 CAD. This was given in 3 installments distributed across the duration of 3 month internship.\n\n# Can you provide any resources to check out your project ?\n\nThe project is not open source, but you can check this presentation:\n\n[ChipyardMitacs](https://docs.google.com/presentation/d/18weQG2Cl5PhK9G6LcYd5a6f3P053lsUvtC89QKKy5hw/edit?usp=gmail_thread#slide=id.p)\n\n# Suggestions to the fellow VJTIians who want to go for this internship.\n\nGet 2 LORs, Do a prior RI, Be diligent in follow ups, Be a good communicator, as your presentation will play a bigger role than your skills during selection, Be confident in your independence in your chosen field.\n\n# What is the best way to contact you ?\n\nEmail: ninadjangle3011@gmail.com\n"},"__N_SSG":true}