{"pageProps":{"photo":"/static/images/Team/2024/Siddesh_Patil_24.jpg","title":"Internship at IIT Bombay @eyantra","author":"Siddesh Patil","time":"June 2022 - July 2022","short":"The objective of this project was to program an FPGA based robot using Haskell.","content":"# What was your internship about, and what was the duration of it ?\n\nMy internship was at eYantra, a lab under IIT Bombay. The use of technology to address issues of the real world through various themes is their primary objective. My project was to \"Explore Functional Approach for Hardware Design,\" and the internship lasted for around 7 weeks throughout the summer. The lab is engaged in various such interesting projects and researches.\n\n# How do you approach the Organization/University ?\n\nThis opportunity can be approached by participating in the eYantra Robotics Competition(eYRC). It is a 6-month competition featuring several projects to participate from a range of domains. These domains frequently focus on the progress of mankind. After a series of interviews, opportunities are then presented to the competition's winners and top performers.\n\n# What was your project about ?\n\nThe objective of this project was to program an FPGA based robot using Haskell - a Functional Programming Language, and Clash compiler which is capable of generating Verilog/VHDL/SystemVerilog code out of it. The\nobjective also included comparing different parameters namely efficiency, cost matrix between the Functional approach and the Conventional approach.\n\n# How was the host University in terms of research and campus life ?\n\nThe campus was incredibly welcoming and supportive of its students.\nThere was a lot of positive engagement and knowledge transfer among interns and students from various states in India. While working as an intern, one has the opportunity to learn about all other projects happening concurrently in the lab and campus, which broadens the perspective.\n\n# How much was your stipend ?\n\nConfidential.\n\n# Can you provide any resources to check out your project ?\n\nThe project is not currently open sourced. If ever it becomes open sourced that I will put up a link here.\n\n# Suggestions to the fellow VJTIians who want to go for this internship.\n\nDo actively take part in the eYRC competition that is held annually. Maintain an active presence on their forum and discussion channels. Concentrate on your learnings more; it will never be wasted.\n\n# What is the best way to contact you ?\n\nYou can contact me at my email, [siddesh1patil@gmail.com](mailto:siddesh1patil@gmail.com) or [LinkedIn](https://www.linkedin.com/in/siddesh-patil-497b50206)\n"},"__N_SSG":true}