{"pageProps":{"photo":"/static/images/Team/2023/Dhruvi_Doshi.jpg","title":"GSOC 2022 Github pageOC 2022 @Score Labs","author":"Dhruvi Doshi","time":"May 2022 - Sept 2022","short":"My internship was about making a tool in python to capture IPv6 packets as a system service and develop a debian package for the same.","content":"# What was your internship about, and what was the duration of it ?\n\nGoogle Summer of Code is a global, online program focused on bringing new contributors into open source software development. GSoC Contributors work with an open source organization on a 12+ week programming project under the guidance of mentors. I worked under WebTelescope which is a suborg of Score Labs.\n\n# How do you approach the Organization/University ?\n\nGSoC is an open source student program where students from all over the world participate by submitting proposals for projects they are interested in. Every org participating in GSoC will have an ideas page with many prospect ideas, also some unfinished ideas(or ideas requiring enhancement) from previous GSoC. Some orgs have you commit some code by creating a Pull Request(PR), some have you solve tasks, some may have no necessary criteria except for a proposal. The aspect common to all orgs/mentors is showing your enthusiasm for the project, and to learn. Also having a few(or even one in my case) commits to the org before submitting the proposal will go a long way.\n\nScoreLab [GSOC 2022 Idea page](https://scorelab.org/gsoc/) had a list of projects. Each idea supposedly had a room on gitter. Mine was a fresh project, it didnt have any. I was the first one to approach my mentor through the official gsoc gitter channel of scolabs [here](https://gitter.im/scorelab/scorelab). Mentor then created a separate room for my project: [Survey6](https://gitter.im/scorelab/Survey6). When I showed my interest, my mentor added details of the project in the github repo, until then there was a very brief description. I tried understanding the projects and asked my doubts to mentors. The mentor would not apply regularly tho. I was simply given a proposal template. To show my interest, and that I met requirements of the project I needed something concrete. Since this was a completely new project, I could not make any PRs. I learnt GRPC in both python and c++ and practiced using libpcap in c++ and scapy in python which were then the primary requirements of my project. My doubts about some implementation approaches were still unclear but I managed to create a [demo](https://github.com/dhruvi29/survey6-prototype) of the problem statement as per my understanding. Finally this was the [report](https://docs.google.com/document/d/1SFRqrwRQEgbbtDlJc0c8iOtR9-HyfF6REOoRmyy-sAM/edit?usp=sharing) that I had submitted. Review wasn’t elaborate but positive and that was it.\n\n# What was your project about ?\n\nMy internship was about making a tool in python to capture IPv6 packets as a system service and develop a debian package for the same.\n\n# How was the host University in terms of research and campus life ?\n\nHonestly, Score Labs, as a community, isn’t very great. It is not very much like a community. The main mentor who is the core community member seemed least responsive and least responsible. He would miss our scheduled meets with not very genuine reasons. The second mentor was a final year student too (same batch as mine), he would be responsive and help me out, but he himself did not have much clue about the objective of the project. He was on the same page as me, so couldn’t help much.\n\n# How much was your stipend ?\n\n$1500 in 2 evaluations of 45% (week 6) and 55% (week 12) payment\n\n# Can you provide any resources to check out your project ?\n\nGSoC Project Page : https://summerofcode.withgoogle.com/programs/2022/projects/jlm7VZtC\nProject GitHub : https://github.com/web-telescope/survey6\nBlogs : https://medium.com/@dhruvidoshi\n\n# Suggestions to the fellow VJTIians who want to go for this internship.\n\nDefinitely try for GSOC. Regrets hurt more than rejections. Preferably go for large projects.\nSearch for good projects that are worth your time. Do not do GSOC just for its batch; otherwise you’ll get plenty of useless projects. Look for good mentors maybe by tracking public channels. Great projects and orgs need you to start early.\n\n# What is the best way to contact you ?\n\nYou can contact me at my email, [drdoshi29@gmail.com](drdoshi29@gmail.com)\n\nConnect with me on LinkedIn [https://www.linkedin.com/in/dhruvi-doshi/](https://www.linkedin.com/in/dhruvi-doshi/)\n"},"__N_SSG":true}